zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_events.h
/**
  ******************************************************************************
  * @file    stm32wb07_06_events.h
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Header file for external uC - stm32wb07_06 in network coprocessor mode
  *          (Event callbacks). Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef _STM32WB07_06_EVENTS_H_
#define _STM32WB07_06_EVENTS_H_

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>
#include "ble_status.h"
#include "compiler.h"
#include "stm32wb07_06_types.h"
/**
  *@defgroup HCI_events HCI events
  *@brief HCI events layer.
  *@{
  */
/* HCI events */
/** Documentation for C struct handle_packets_pair_entry_t */
typedef struct handle_packets_pair_entry_t_s
{
  /** Connection handle
   */
  uint16_t connection_handle;
  /** The number of HCI Data Packets that have been completed (transmitted or flushed)
    *  for the associated connection_handle since the previous time the event was
    *  returned.
    */
  uint16_t hc_num_of_completed_packets;
} handle_packets_pair_entry_t;
/**
  * @brief The Disconnection Complete event occurs when a connection is
  *        terminated. The status parameter indicates if the disconnection was
  *        successful or not. The reason parameter indicates the reason for the
  *        disconnection if the disconnection was successful. If the
  *        disconnection was not successful, the value of the reason parameter
  *        can be ignored by the Host. For example, this can be the case if the
  *        Host has issued the Disconnect command and there was a parameter
  *        error, or the command was not presently allowed, or a
  *        connection_handle that didn't correspond to a connection was given.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle connection_handle which was disconnected.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason reason for disconnection. See Error Codes.
  * @retval None
  */
void hci_disconnection_complete_event(uint8_t status,
                                      uint16_t connection_handle,
                                      uint8_t reason);
/**
  * @brief The Encryption Change event is used to indicate that the change of the
  *        encryption mode has been completed. The connection_handle will be a
  *        connection_handle for an ACL connection. The encryption_enabled event
  *        parameter specifies the new encryption_enabled parameter for the
  *        connection_handle specified by the connection_handle event parameter.
  *        This event will occur on both devices to notify the Hosts when
  *        Encryption has changed for the specified connection_handle between two
  *        devices. Note: This event shall not be generated if encryption is
  *        paused or resumed; during a role switch, for example. The meaning of
  *        the encryption_enabled parameter depends on whether the Host has
  *        indicated support for Secure Connections in the
  *        Secure_Connections_Host_Support parameter. When
  *        Secure_Connections_Host_Support is 'disabled' or the connection_handle
  *        refers to an LE link, the Controller shall only use encryption_enabled
  *        values 0x00 (OFF) and 0x01 (ON). (See Bluetooth Specification v.4.1,
  *        Vol. 2, Part E, 7.7.8)
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param encryption_enabled Link Level Encryption.
  *        Values:
  *        - 0x00: Link Level Encryption OFF
  *        - 0x01: Link Level Encryption is ON with AES-CCM
  * @retval None
  */
void hci_encryption_change_event(uint8_t status,
                                 uint16_t connection_handle,
                                 uint8_t encryption_enabled);
/**
  * @brief The Read Remote Version Information Complete event is used to indicate
  *        the completion of the process obtaining the version information of the
  *        remote Controller specified by the connection_handle event parameter.
  *        The connection_handle shall be for an ACL connection. The Version
  *        event parameter defines the specification version of the LE
  *        Controller. The manufacturer_name event parameter indicates the
  *        manufacturer of the remote Controller. The Subversion event parameter
  *        is controlled by the manufacturer and is implementation dependent. The
  *        Subversion event parameter defines the various revisions that each
  *        version of the Bluetooth hardware will go through as design processes
  *        change and errors are fixed. This allows the software to determine
  *        what Bluetooth hardware is being used and, if necessary, to work
  *        around various bugs in the hardware. When the connection_handle is
  *        associated with an LE-U logical link, the Version event parameter
  *        shall be Link Layer VersNr parameter, the manufacturer_name event
  *        parameter shall be the CompId parameter, and the Subversion event
  *        parameter shall be the SubVersNr parameter. (See Bluetooth
  *        Specification v.4.1, Vol. 2, Part E, 7.7.12)
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param version Version of the Current LMP in the remote Controller
  * @param manufacturer_name Manufacturer Name of the remote Controller
  * @param subversion Subversion of the LMP in the remote Controller
  * @retval None
  */
void hci_read_remote_version_information_complete_event(uint8_t status,
                                                        uint16_t connection_handle,
                                                        uint8_t version,
                                                        uint16_t manufacturer_name,
                                                        uint16_t subversion);
/**
  * @brief The Hardware Error event is used to indicate some implementation
  *        specific type of hardware failure for the controller. This event is
  *        used to notify the Host that a hardware failure has occurred in the
  *        Controller.
  * @param hardware_code Error code 0x01 and 0x02 are errors generally caused by
  *        hardware issue on the PCB; another possible cause is a slow crystal
  *        startup. In the latter case, the HS_STARTUP_TIME in the device
  *        configuration needs to be tuned. Error code 0x03 indicates an internal
  *        error of the protocol stack. This event with error code 0x04 is raised
  *        when a radio interrupt is served late. This usually happens when
  *        interrupts are disabled for too long time or when a flash operation is
  *        performed. Stack will try to recover the situation, so there is
  *        normally no need to reset the device. However this condition should be
  *        avoided as much as possible. Error code 0x05 is raised when an error
  *        happens during a TX transaction. After this event is received with
  *        error code 0x00, 0x01, 0x02 or 0x03, it is recommended to force a
  *        device reset.
  *        Values:
  *        - 0x00: Generic HW error
  *        - 0x01: Radio state error
  *        - 0x02: Timer overrun error
  *        - 0x03: Internal queue overflow error
  *        - 0x04: Late Radio ISR
  *        - 0x05: TX Error
  * @retval None
  */
void hci_hardware_error_event(uint8_t hardware_code);
/**
  * @brief The Number Of Completed Packets event is used by the Controller to
  *        indicate to the Host how many HCI Data Packets have been completed
  *        (transmitted or flushed) for each connection_handle since the previous
  *        Number Of Completed Packets event was sent to the Host. This means
  *        that the corresponding buffer space has been freed in the Controller.
  *        Based on this information, and the HC_Total_Num_ACL_Data_Packets and
  *        HC_Total_Num_Synchronous_- Data_Packets return parameter of the
  *        Read_Buffer_Size command, the Host can determine for which
  *        Connection_Handles the following HCI Data Packets should be sent to
  *        the Controller. The Number Of Completed Packets event must not be sent
  *        before the corresponding Connection Complete event. While the
  *        Controller has HCI data packets in its buffer, it must keep sending
  *        the Number Of Completed Packets event to the Host at least
  *        periodically, until it finally reports that all the pending ACL Data
  *        Packets have been transmitted or flushed.
  * @param number_of_handles The number of Connection_Handles and
  *        Num_HCI_Data_Packets parameters pairs contained in this event
  * @param handle_packets_pair_entry See @ref handle_packets_pair_entry_t
  * @retval None
  */
void hci_number_of_completed_packets_event(uint8_t number_of_handles,
                                           handle_packets_pair_entry_t handle_packets_pair_entry[]);
/**
  * @brief 'This event is used to indicate that the Controller's data buffers
  *        have been overflowed. This can occur if the Host has sent more packets
  *        than allowed. The link_type parameter is used to indicate that the
  *        overflow was caused by ACL data.
  * @param link_type On which type of channel overflow has occurred.
  *        Values:
  *        - 0x01: ACL Buffer Overflow
  * @retval None
  */
void hci_data_buffer_overflow_event(uint8_t link_type);
/**
  * @brief 'The Encryption Key Refresh Complete event is used to indicate to the
  *        Host that the encryption key was refreshed on the given
  *        connection_handle any time encryption is paused and then resumed. If
  *        the Encryption Key Refresh Complete event was generated due to an
  *        encryption pause and resume operation embedded within a change
  *        connection link key procedure, the Encryption Key Refresh Complete
  *        event shall be sent prior to the Change Connection Link Key Complete
  *        event. If the Encryption Key Refresh Complete event was generated due
  *        to an encryption pause and resume operation embedded within a role
  *        switch procedure, the Encryption Key Refresh Complete event shall be
  *        sent prior to the Role Change event.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */
void hci_encryption_key_refresh_complete_event(uint8_t status,
                                               uint16_t connection_handle);
/**
  * @brief The HCI_Authenticated_Payload_Timeout_Expired event is used to
  *        indicate that a packet containing a valid MIC on the connection_handle
  *        was not received within the authenticatedPayloadTO. Note: A Host may
  *        choose to disconnect the link when this occurs.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */
void hci_authenticated_payload_timeout_expired_event(uint16_t connection_handle);
/**
  * @brief API used to receive HCI ACL Data Packets to exchange data between the Host and Controller.
  *
  * @note The API name is only available in link layer only mode.
  *
  * @param      connection_handle  Connection handle for which the command is given. Range:
  *                                0x0000-0x0EFF (0x0F00 - 0x0FFF Reserved for future use)
  * @param      pb_flag            Packet boundary flag
  * @param      bc_flag            Broadcast flag
  * @param      data_length        Length of PDU data in octets.
  * @param[in]  pdu_data           PDU data pointer
  *
  * @return  Error code
  */
ble_status_t hci_rx_acl_data_event(uint16_t connection_handle, uint8_t  pb_flag, uint8_t  bc_flag,
                                   uint16_t  data_length, uint8_t  *pdu_data);
/**
  * @}
  */
/**
  *@defgroup HCI_LE_meta_events HCI LE meta events
  *@brief HCI LE meta events layer.
  *@{
  */
/* HCI LE meta events */
/** Documentation for C struct advertising_report_t */
typedef struct advertising_report_t_s
{
  /** Type of advertising report event: ADV_IND: Connectable undirected advertising',
    *  ADV_DIRECT_IND: Connectable directed advertising, ADV_SCAN_IND: Scannable
    *  undirected advertising, ADV_NONCONN_IND: Non connectable undirected
    *  advertising, SCAN_RSP: Scan response.
    *  Values:
    *  - 0x00: ADV_IND
    *  - 0x01: ADV_DIRECT_IND
    *  - 0x02: ADV_SCAN_IND
    *  - 0x03: ADV_NONCONN_IND
    *  - 0x04: SCAN_RSP
    */
  uint8_t event_type;
  /** 0x00 Public Device Address 0x01 Random Device Address 0x02 Public Identity
    *  Address (Corresponds to Resolved Private Address) 0x03 Random (Static)
    *  Identity Address (Corresponds to Resolved Private Address)
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address
    *  - 0x03: Random (Static) Identity Address
    */
  uint8_t address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the advertising device.
    */
  uint8_t address[6];
  /** Length of the Data[i] field for each device which responded.
    *  Values:
    *  - 0 ... 31
    */
  uint8_t data_length;
  /** data_length octets of advertising or scan response data formatted as defined in
    *  [Vol 3] Part C, Section 8.
    */
  uint8_t *data;
  /** N Size: 1 Octet (signed integer) Units: dBm
    *  Values:
    *  - -127 ... 20
    *  - 127: RSSI not available
    */
  int8_t rssi;
} advertising_report_t;
/** Documentation for C struct direct_advertising_report_t */
typedef struct direct_advertising_report_t_s
{
  /** Advertising type
    *  Values:
    *  - 0x01: Connectable directed advertising (ADV_DIRECT_IND)
    */
  uint8_t event_type;
  /** 0x00 Public Device Address 0x01 Random Device Address 0x02 Public Identity
    *  Address (Corresponds to Resolved Private Address) 0x03 Random (Static)
    *  Identity Address (Corresponds to Resolved Private Address)
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address
    *  - 0x03: Random (Static) Identity Address
    */
  uint8_t address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the advertising device.
    */
  uint8_t address[6];
  /** 0x01 Random Device Address
    *  Values:
    *  - 0x01: Random Device Address
    */
  uint8_t direct_address_type;
  /** Random Device Address
   */
  uint8_t direct_address[6];
  /** N Size: 1 Octet (signed integer) Units: dBm
    *  Values:
    *  - -127 ... 20
    *  - 127: RSSI not available
    */
  int8_t rssi;
} direct_advertising_report_t;
