zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_events.h
/** Documentation for C struct extended_advertising_report_t */
typedef struct extended_advertising_report_t_s
{
  /** Event Type parameter. Bits from 0 to 4: 0 Connectable advertising 1 Scannable
    *  advertising 2 Directed advertising 3 Scan response 4 Legacy advertising
    *  PDUs used Bits 5-6 Data status: 00b = Complete 01b = Incomplete, more data
    *  to come 10b = Incomplete, data truncated, no more to come 11b = Reserved
    *  for future use
    *  Flags:
    *  - 0x0001: Connectable advertising
    *  - 0x0002: Scannable advertising
    *  - 0x0004: Directed advertising
    *  - 0x0008: Scan response
    *  - 0x0010: Legacy advertising PDUs used
    */
  uint16_t event_type;
  /** Address Type
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address (corresponds to Resolved Private Address)
    *  - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
    *  - 0xFF: No address provided (anonymous advertisement)
    */
  uint8_t address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the advertising device.
    */
  uint8_t address[6];
  /** PHY used to send the advertising PDU on the primary advertising physical
    *  channel.
    *  Values:
    *  - 0x01: LE_1M_PHY
    *  - 0x03: LE_CODED_PHY
    */
  uint8_t primary_phy;
  /** This parameter indicates the PHY used to send the advertising PDU(s), if any, on
    *  the secondary advertising physical channel.
    *  Values:
    *  - 0x00: No packets
    *  - 0x01: LE_1M_PHY
    *  - 0x02: LE_2M_PHY
    *  - 0x03: LE_CODED_PHY
    */
  uint8_t secondary_phy;
  /** Advertising SID subfield in the ADI field of the PDU
    *  Values:
    *  - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
    *  - 0xFF: No ADI field in the PDU
    */
  uint8_t advertising_sid;
  /** Tx Power. Units: dBm.
    *  Values:
    *  - -127 ... 126
    *  - 127: NA
    */
  int8_t tx_power;
  /** RSSI value; Units: dBm; All other values Reserved for future use.
    *  Values:
    *  - -127 ... 20
    *  - 127: NA
    */
  int8_t rssi;
  /** Interval of the periodic advertising. Time = N * 1.25 ms; Time Range: 7.5 ms to
    *  81,918.75 s.
    *  Values:
    *  - 0x0000 (NaN) : No periodic advertising
    *  - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Interval of the periodic advertising
    */
  uint16_t periodic_advertising_interval;
  /** Direct address type
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    *  - 0x02: Public Identity Address (Corresponds to Resolved Private Address)
    *  - 0x03: Random (static) Identity Address (Corresponds to Resolved Private Address)
    *  - 0x04 ... 0xFD: Reserved for future use
    *  - 0xFE: Random Device Address (Controller unable to resolve)
    *  - 0xFF: Reserved for future use
    */
  uint8_t direct_address_type;
  /** Public Device Address, Random Device Address, Public Identity Address or Random
    *  (static) Identity Address of the target device
    */
  uint8_t direct_address[6];
  /** Length of the Data[i] field for each device which responded
    *  Values:
    *  - 0 ... 229: Length of the Data[i] field for each device which responded
    *  - 229 ... 255: Reserved for future use
    */
  uint8_t data_length;
  /** data_length[i] octets of advertising or scan response data formatted as defined
    *  in [Vol 3] Part C, Section 11. Note: Each element of this array has a
    *  variable length.
    */
  uint8_t *data;
} extended_advertising_report_t;
/** Documentation for C struct samples_t */
typedef struct samples_t_s
{
  /** The list of I samples for the reported packet. Each sample is a signed integer.
    *  The list is in the order of the sampling points within the packet.
    */
  int8_t i_sample;
  /** The list of Q samples for the reported packet. Each sample is a signed integer.
    *  The list is in the order of the sampling points within the packet.
    */
  int8_t q_sample;
} samples_t;
/**
  * @brief The LE Connection Complete event indicates to both of the Hosts
  *        forming the connection that a new connection has been created. Upon
  *        the creation of the connection a connection_handle shall be assigned
  *        by the Controller, and passed to the Host in this event. If the
  *        connection establishment fails this event shall be provided to the
  *        Host that had issued the LE_Create_Connection command. This event
  *        indicates to the Host which issued a LE_Create_Connection command and
  *        received a Command status event if the connection establishment failed
  *        or was successful. The master_clock_accuracy parameter is only valid
  *        for a slave. On a master, this parameter shall be set to 0x00.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param role Role of the local device in the connection.
  *        Values:
  *        - 0x00: Master
  *        - 0x01: Slave
  * @param peer_address_type The address type of the peer device.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param peer_address Public Device Address or Random Device Address of the
  *        peer device
  * @param conn_interval Connection interval used on this connection. Time = N *
  *        1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param master_clock_accuracy Master clock accuracy. Only valid for a slave.
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */
void hci_le_connection_complete_event(uint8_t status,
                                      uint16_t connection_handle,
                                      uint8_t role,
                                      uint8_t peer_address_type,
                                      uint8_t peer_address[6],
                                      uint16_t conn_interval,
                                      uint16_t conn_latency,
                                      uint16_t supervision_timeout,
                                      uint8_t master_clock_accuracy);
/**
  * @brief The LE Advertising Report event indicates that a Bluetooth device or
  *        multiple Bluetooth devices have responded to an active scan or
  *        received some information during a passive scan. The Controller may
  *        queue these advertising reports and send information from multiple
  *        devices in one LE Advertising Report event.
  * @param num_reports Number of responses in this event.
  *        Values:
  *        - 0x01
  * @param advertising_report See @ref advertising_report_t
  * @retval None
  */
void hci_le_advertising_report_event(uint8_t num_reports,
                                     advertising_report_t advertising_report[]);
/**
  * @brief The LE Connection Update Complete event is used to indicate that the
  *        Controller process to update the connection has completed. On a slave,
  *        if no connection parameters are updated, then this event shall not be
  *        issued. On a master, this event shall be issued if the
  *        Connection_Update command was sent.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param conn_interval Connection interval used on this connection. Time = N *
  *        1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @retval None
  */
void hci_le_connection_update_complete_event(uint8_t status,
                                             uint16_t connection_handle,
                                             uint16_t conn_interval,
                                             uint16_t conn_latency,
                                             uint16_t supervision_timeout);
/**
  * @brief The LE Read Remote Used Features Complete event is used to indicate
  *        the completion of the process of the Controller obtaining the used
  *        features of the remote Bluetooth device specified by the
  *        connection_handle event parameter.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param le_features Bit Mask List of used LE features. For details see LE Link
  *        Layer specification.
  * @retval None
  */
void hci_le_read_remote_used_features_complete_event(uint8_t status,
                                                     uint16_t connection_handle,
                                                     uint8_t le_features[8]);
/**
  * @brief The LE Long Term Key Request event indicates that the master device is
  *        attempting to encrypt or re-encrypt the link and is requesting the
  *        Long Term Key from the Host. (See [Vol 6] Part B, Section 5.1.3).
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param random_number 64-bit random number
  * @param encrypted_diversifier 16-bit encrypted diversifier
  * @retval None
  */
void hci_le_long_term_key_request_event(uint16_t connection_handle,
                                        uint8_t random_number[8],
                                        uint16_t encrypted_diversifier);
/**
  * @brief The LE Data Length Change event notifies the Host of a change to
  *        either the maximum Payload length or the maximum transmission time of
  *        Data Channel PDUs in either direction. The values reported are the
  *        maximum that will actually be used on the connection following the
  *        change.
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param max_tx_octets The maximum number of payload octets in a Link Layer Data
  *        Channel PDU that the local Controller will send on this connection
  *        (connEffectiveMaxTxOctets defined in [Vol 6] Part B, Section 4.5.10).
  *        Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for
  *        future use)
  * @param max_tx_time The maximum time that the local Controller will take to send
  *        a Link Layer Data Channel PDU on this connection (connEffectiveMaxTx-
  *        Time defined in [Vol 6] Part B, Section 4.5.10). Range 0x0148-0x0848
  *        (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for future use)
  * @param max_rx_octets The maximum number of payload octets in a Link Layer Data
  *        Channel PDU that the local controller expects to receive on this
  *        connection (connEfectiveMaxRxOctets defined in [Vol 6] Part B, Section
  *        4.5.10). Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF
  *        Reserved for future use)
  * @param max_rx_time The maximum time that the local Controller expects to take
  *        to receive a Link Layer Data Channel PDU on this connection
  *        (connEffectiveMax-RxTime defined in [Vol 6] Part B, Section 4.5.10).
  *        Range 0x0148-0x0848 (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for
  *        future use)
  * @retval None
  */
void hci_le_data_length_change_event(uint16_t connection_handle,
                                     uint16_t max_tx_octets,
                                     uint16_t max_tx_time,
                                     uint16_t max_rx_octets,
                                     uint16_t max_rx_time);
/**
  * @brief This event is generated when local P-256 key generation is complete.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param local_p256_public_key Local P-256 public key.
  * @retval None
  */
void hci_le_read_local_p256_public_key_complete_event(uint8_t status,
                                                      uint8_t local_p256_public_key[64]);
/**
  * @brief This event indicates that LE Diffie Hellman key generation has been
  *        completed by the Controller.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param dh_key Diffie Hellman Key
  * @retval None
  */
void hci_le_generate_dhkey_complete_event(uint8_t status,
                                          uint8_t dh_key[32]);
/**
  * @brief The LE Enhanced Connection Complete event indicates to both of the
  *        Hosts forming the connection that a new connection has been created.
  *        Upon the creation of the connection a connection_handle shall be
  *        assigned by the Controller, and passed to the Host in this event. If
  *        the connection establishment fails, this event shall be provided to
  *        the Host that had issued the LE_Create_Connection command. If this
  *        event is unmasked and LE Connection Complete event is unmasked, only
  *        the LE Enhanced Connection Complete event is sent when a new
  *        connection has been completed. This event indicates to the Host that
  *        issued a LE_Create_Connection command and received a Command status
  *        event if the connection establishment failed or was successful. The
  *        master_clock_accuracy parameter is only valid for a slave. On a
  *        master, this parameter shall be set to 0x00.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param role Role of the local device in the connection.
  *        Values:
  *        - 0x00: Master
  *        - 0x01: Slave
  * @param peer_address_type 0x00 Public Device Address 0x01 Random Device
  *        Address 0x02 Public Identity Address (Corresponds to Resolved Private
  *        Address) 0x03 Random (Static) Identity Address (Corresponds to
  *        Resolved Private Address)
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Public Identity Address
  *        - 0x03: Random (Static) Identity Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address or Random (static) Identity Address of the device to
  *        be connected.
  * @param local_resolvable_private_address Resolvable Private Address being used
  *        by the local device for this connection. This is only valid when the
  *        own_address_type is set to 0x02 or 0x03. For other own_address_type
  *        values, the Controller shall return all zeros.
  * @param peer_resolvable_private_address Resolvable Private Address being used
  *        by the peer device for this connection. This is only valid for
  *        peer_address_type 0x02 and 0x03. For other peer_address_type values,
  *        the Controller shall return all zeros.
  * @param conn_interval Connection interval used on this connection. Time = N *
  *        1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param master_clock_accuracy Master clock accuracy. Only valid for a slave.
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */
void hci_le_enhanced_connection_complete_event(uint8_t status,
                                               uint16_t connection_handle,
                                               uint8_t role,
                                               uint8_t peer_address_type,
                                               uint8_t peer_address[6],
                                               uint8_t local_resolvable_private_address[6],
                                               uint8_t peer_resolvable_private_address[6],
                                               uint16_t conn_interval,
                                               uint16_t conn_latency,
                                               uint16_t supervision_timeout,
                                               uint8_t master_clock_accuracy);
/**
  * @brief The LE Direct Advertising Report event indicates that directed
  *        advertisements have been received where the advertiser is using a
  *        resolvable private address for the InitA field in the ADV_DIRECT_IND
  *        PDU and the scanning_filter_policy is equal to 0x02 or 0x03, see
  *        HCI_LE_Set_Scan_Parameters. direct_address_type and Direct_Addres is
  *        the address the directed advertisements are being directed to.
  *        address_type and Address is the address of the advertiser sending the
  *        directed advertisements.
  * @param num_reports Number of responses in this event.
  *        Values:
  *        - 0x01
  * @param direct_advertising_report See @ref direct_advertising_report_t
  * @retval None
  */
void hci_le_direct_advertising_report_event(uint8_t num_reports,
                                            direct_advertising_report_t direct_advertising_report[]);
/**
  * @brief The LE PHY Update Complete Event is used to indicate that the
  *        Controller has changed the transmitter PHY or receiver PHY in use. If
  *        the Controller changes the transmitter PHY, the receiver PHY, or both
  *        PHYs, this event shall be issued. If an LE_Set_PHY command was sent
  *        and the Controller determines that neither PHY will change as a
  *        result, it issues this event immediately.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param tx_phy The transmitter PHY for the connection
  *        Values:
  *        - 0x01: The transmitter PHY for the connection is LE 1M
  *        - 0x02: The transmitter PHY for the connection is LE 2M
  *        - 0x03: The transmitter PHY for the connection is LE Coded
  * @param rx_phy The receiver PHY for the connection
  *        Values:
  *        - 0x01: The receiver PHY for the connection is LE 1M
  *        - 0x02: The receiver PHY for the connection is LE 2M
  *        - 0x03: The receiver PHY for the connection is LE Coded
  * @retval None
  */
void hci_le_phy_update_complete_event(uint8_t status,
                                      uint16_t connection_handle,
                                      uint8_t tx_phy,
                                      uint8_t rx_phy);
/**
  * @brief The LE Extended Advertising Report event indicates that one or more
  *        Bluetooth devices have responded to an active scan or have broadcast
  *        advertisements that were received during a passive scan. The
  *        Controller may coalesce multiple advertising reports from the same or
  *        different advertisers into a single LE Extended Advertising Report
  *        event, provided all the parameters from all the advertising reports
  *        fit in a single HCI event. This event shall only be generated if
  *        scanning was enabled using the LE Set Extended Scan Enable command. It
  *        reports advertising events using either legacy or extended advertising
  *        PDUs. The Controller may split the data from a single advertisement
  *        (whether one PDU or several) into several reports. If so, each report
  *        except the last shall have an event_type with a data status field of
  *        "incomplete, more data to come", while the last shall have the value
  *        "complete"; the address_type, Address, advertising_sid, primary_phy,
  *        and secondary_phy fields shall be the same in all the reports. When a
  *        scan response is received, bits 0-2 and 4 of the event type shall
  *        indicate the properties of the original advertising event. An
  *        event_type with a data status field of "incomplete, data truncated"
  *        indicates that the Controller attempted to receive an AUX_CHAIN_IND
  *        PDU but was not successful.
  * @param num_reports Number of separate reports in the event
  *        Values:
  *        - 0x01 ... 0x0A
  * @param extended_adv_report See @ref extended_advertising_report_t
  * @retval None
  */
void hci_le_extended_advertising_report_event(uint8_t num_reports,
                                              extended_advertising_report_t extended_adv_report[]);
/**
  * @brief The LE Periodic Advertising Report event indicates that the Controller
  *        has received a Periodic Advertising packet. The sync_handle parameter
  *        indicates the identifier for the periodic advertisements specified by
  *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
  *        The Controller may split the data from a single periodic advertisement
  *        (whether one PDU or several) into several reports. If so, each report
  *        except the last shall have a data_status of "incomplete, more data to
  *        come", while the last shall have the value "complete". A data_status
  *        of "incomplete, data truncated" indicates that the Controller
  *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
  *        Unused parameter shall be set to 0xFF by the Controller and ignored by
  *        the Host.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
