zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_events.h
  *        part D. For proprietary error code refer to Error codes section.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param advertising_sid Advertising SID subfield in the ADI field of the PDU
  *        Values:
  *        - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
  *        - 0x10 ... 0xFF: Reserved for future use
  * @param advertiser_address_type Advertising Address Type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
  *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
  *        - 0x04 ... 0xFF: Reserved for future use
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertiser_phy Advertiser PHY
  *        Values:
  *        - 0x01: Advertiser PHY is LE 1M
  *        - 0x02: Advertiser PHY is LE 2M
  *        - 0x03: Advertiser PHY is LE Coded
  *        - 0x04 ... 0xFF: Reserved for future use
  * @param periodic_advertising_interval Periodic Advertising Interval Time = N *
  *        1.25 ms Time Range: 7.5 ms to 81.91875 s
  *        Values:
  *        - 0x0006 ... 0xFFFF: Periodic Advertising Interval
  * @param advertiser_clock_accuracy Advertiser Clock Accuracy
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  *        - 0x08 ... 0xFF: Reserved for future use
  * @retval None
  */
void hci_le_periodic_advertising_sync_established_event(uint8_t status,
                                                        uint16_t sync_handle,
                                                        uint8_t advertising_sid,
                                                        uint8_t advertiser_address_type,
                                                        uint8_t advertising_address[6],
                                                        uint8_t advertiser_phy,
                                                        uint16_t periodic_advertising_interval,
                                                        uint8_t advertiser_clock_accuracy);
/**
  * @brief The LE Periodic Advertising Report event indicates that the Controller
  *        has received a Periodic Advertising packet. The sync_handle parameter
  *        indicates the identifier for the periodic advertisements specified by
  *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
  *        The Controller may split the data from a single periodic advertisement
  *        (whether one PDU or several) into several reports. If so, each report
  *        except the last shall have a data_status of "incomplete, more data to
  *        come", while the last shall have the value "complete". A data_status
  *        of "incomplete, data truncated" indicates that the Controller
  *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
  *        Unused parameter shall be set to 0xFF by the Controller and ignored by
  *        the Host.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param tx_power TX Power. Units: dBm
  *        Values:
  *        - -127 ... 126
  *        - 127: NA
  * @param rssi RSSI value Units: dBm
  *        Values:
  *        - -127 ... 20: RSSI value
  *        - 127: RSSI is not available
  * @param cte_type
  *        Values:
  *        - 0x00: AoA Constant Tone Extension
  *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
  *        - 0xFF: No Constant Tone Extension
  * @param data_status Data status
  *        Values:
  *        - 0x00: Data complete
  *        - 0x01: Data incomplete, more data to come
  *        - 0x02: Data incomplete, data truncated, no more to come
  *        - 0x03 ... 0xFF: Reserved for future use
  * @param data_length Length of the Data field
  *        Values:
  *        - 0 ... 247: Length of the Data field
  *        - 248 ... 255: Reserved for future use
  * @param data Data received from a Periodic Advertising packet
  * @retval None
  */
void hci_le_periodic_advertising_report_event(uint16_t sync_handle,
                                              int8_t tx_power,
                                              int8_t rssi,
                                              uint8_t cte_type,
                                              uint8_t data_status,
                                              uint8_t data_length,
                                              uint8_t data[]);
/**
  * @brief The LE Periodic Advertising Sync Lost event indicates that the
  *        Controller has not received a Periodic Advertising packet identified
  *        by sync_handle within the timeout period.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */
void hci_le_periodic_advertising_sync_lost_event(uint16_t sync_handle);
/**
  * @brief The LE Scan Timeout event indicates that scanning has ended because
  *        the duration has expired. This event shall only be generated if
  *        scanning was enabled using the LE Set Extended Scan Enable command.
  * @retval None
  */
void hci_le_scan_timeout_event(void);
/**
  * @brief The LE Advertising Set Terminated event indicates that the Controller
  *        has terminated advertising in the advertising sets specified by the
  *        advertising_handle parameter. This event shall be generated every time
  *        connectable advertising in an advertising set results in a connection
  *        being created. This event shall only be generated if advertising was
  *        enabled using the LE Set Extended Advertising Enable command. The
  *        connection_handle parameter is only valid when advertising ends
  *        because a connection was created. If the
  *        max_extended_advertising_events parameter in the
  *        LE_Set_Extended_Advertising_Enable command was non-zero, the
  *        num_completed_extended_advertising_events parameter shall be set to
  *        the number of completed extended advertising events the Controller had
  *        transmitted when either the duration elapsed or the maximum number of
  *        extended advertising events was reached; otherwise it shall be set to
  *        zero. If advertising has terminated as a result of the advertising
  *        duration elapsing, the status parameter shall be set to the error code
  *        Advertising Timeout (0x3C). If advertising has terminated because the
  *        max_extended_advertising_events was reached, the status parameter
  *        shall be set to the error code Limit Reached (0x43).
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param advertising_handle Advertising handle in which advertising has ended
  *        Values:
  *        - 0x00 ... 0xEF: advertising_handle in which advertising has ended
  *        - 0xF0 ... 0xFF: Reserved for future use
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param num_completed_extended_advertising_events Number of completed extended
  *        advertising events transmitted by the Controller
  * @retval None
  */
void hci_le_advertising_set_terminated_event(uint8_t status,
                                             uint8_t advertising_handle,
                                             uint16_t connection_handle,
                                             uint8_t num_completed_extended_advertising_events);
/**
  * @brief The LE Scan Request Received event indicates that a SCAN_REQ PDU or an
  *        AUX_SCAN_REQ PDU has been received by the advertiser. The request
  *        contains a device address from a scanner that is allowed by the
  *        advertising filter policy. The advertising set is identified by
  *        advertising_handle. This event shall only be generated if advertising
  *        was enabled using the LE Set Extended Advertising Enable command. The
  *        scanner_address_type and scanner_address indicates the type of the
  *        address and the address of the scanner device.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  *        - 0xF0 ... 0xFF: Reserved for future use
  * @param scanner_address_type Scanner address  type
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
  *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
  *        - 0x04 ... 0xFF: Reserved for future use
  * @param scanner_address Public Device Address, Random Device Address, Public
  *        Identity Address or Random (static) Identity Address of the
  *        advertising device
  * @retval None
  */
void hci_le_scan_request_received_event(uint8_t advertising_handle,
                                        uint8_t scanner_address_type,
                                        uint8_t scanner_address[6]);
/**
  * @brief The LE Channel Selection Algorithm Event indicates which channel
  *        selection algorithm is used on a data channel connection (see [Vol 6]
  *        Part B, Section 4.5.8).
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param channel_selection_algorithm Channel selection algorithm to be  used on
  *        a data channel connection
  *        Values:
  *        - 0x00: LE Channel Selection Algorithm #1 is used
  *        - 0x01: LE Channel Selection Algorithm #2 is used
  *        - 0x02 ... 0xFF: Reserved for future use
  * @retval None
  */
void hci_le_channel_selection_algorithm_event(uint16_t connection_handle,
                                              uint8_t channel_selection_algorithm);
/**
  * @brief The HCI_LE_Connectionless_IQ_Report event is used by the Controller to
  *        report IQ information from the Constant Tone Extension of a received
  *        advertising packet forming part of the periodic advertising train
  *        identified by sync_handle and to report IQ information from the
  *        Constant Tone Extension of a received Test Mode packet (see Section
  *        7.8.28). The index of the channel on which the packet was received,
  *        the RSSI of the packet (excluding the Constant Tone Extension), the ID
  *        of the antenna on which this was measured, the type of Constant Tone
  *        Extension, the value of paEventCounter, and the IQ samples of the
  *        Constant Tone Extension of the advertisement are reported in the
  *        corresponding parameters. For any given sample, either both or neither
  *        of i_sample[i] and q_sample[i] shall equal 0x80. The slot_durations
  *        parameter specifies the sampling rate used by the Controller. The
  *        packet_status parameter indicates whether the received packet had a
  *        valid CRC and, if not, whether the Controller has determined the
  *        position and size of the Constant Tone Extension using the Length and
  *        CTETime fields. Note: A Controller is not required to generate this
  *        event for packets that have a bad CRC. The Constant Tone Extension
  *        format is defined in [Vol 6] Part B, Section 2.5.1. If the PDU
  *        contains AdvData, then the HCI_LE_Periodic_Advertising_Report event
  *        shall be generated before this event. The Controller is not required
  *        to generate this event for a Constant Tone Extension with a type that
  *        it does not support. This event is also used by the Controller to
  *        report that it has insufficient resources to report IQ samples for all
  *        received Constant Tone Extensions and has failed to sample at least
  *        once. In this case packet_status shall be set to 0xFF and sample_count
  *        to 0x00.
  * @param sync_handle sync_handle identifying the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  *        - 0x0FFF: TEST_SYNC_HANDLE
  * @param channel_index 0x25-0x27 can be used only for packets generated during
  *        test modes.
  *        Values:
  *        - 0x00 ... 0x27: The index of the channel on which the packet was received.
  * @param rssi RSSI of the packet. Units: 0.1 dBm.
  *        Values:
  *        - -1270 ... 200
  * @param rssi_antenna_id Antenna ID
  * @param cte_type Type of Constant Tone Extension.
  *        Values:
  *        - 0x00: AoA_CTE
  *        - 0x01: AoD_CTE_1us
  *        - 0x02: AoD_CTE_2us
  * @param slot_durations Sampling rate used by the Controller.
  *        Values:
  *        - 0x01: CTE_SLOT_1us
  *        - 0x02: CTE_SLOT_2us
  * @param packet_status It indicates whether the received packet had a valid CRC
  *        and, if not, whether the Controller has determined the position and
  *        size of the Constant Tone Extension using the Length and CTETime
  *        fields. 0x00 - CRC was correct;  0x01 - CRC was incorrect and the
  *        Length and CTETime fields of the packet were used to determine
  *        sampling points;  0x02 - CRC was incorrect but the Controller has
  *        determined the position and length of the Constant Tone Extension in
  *        some other way;  0xFF - Insufficient resources to sample
  *        (channel_index, cte_type, and slot_durations invalid).
  *        Values:
  *        - 0x00: CRC_OK
  *        - 0x01: CRC_ERROR_1
  *        - 0x02: CRC_ERROR_2
  *        - 0xFF: NO_SAMPLES
  * @param periodic_event_counter The value of paEventCounter (see [Vol 6] Part
  *        B, Section 4.4.2.1) for the reported AUX_SYNC_IND PDU
  * @param sample_count Total number of sample pairs (there shall be the same
  *        number of I samples and Q samples). Note: This number is dependent on
  *        the switch and sample slot durations used.
  *        Values:
  *        - 0x00
  *        - 0x09 ... 0x52
  * @param Samples See @ref samples_t
  * @retval None
  */
void hci_le_connectionless_iq_report_event(uint16_t sync_handle,
                                           uint8_t channel_index,
                                           int16_t rssi,
                                           uint8_t rssi_antenna_id,
                                           uint8_t cte_type,
                                           uint8_t slot_durations,
                                           uint8_t packet_status,
                                           uint16_t periodic_event_counter,
                                           uint8_t sample_count,
                                           samples_t Samples[]);
/**
  * @brief The HCI_LE_Connection_IQ_Report event is used by the Controller to
  *        report the IQ samples from the Constant Tone Extension of a received
  *        packet (see [Vol 6] Part B, Section 2.4.2.26). The connection_handle
  *        parameter identifies the connection that corresponds to the reported
  *        information. The receiver PHY, the index of the data channel, the RSSI
  *        value of the packet (excluding the Constant Tone Extension), the ID of
  *        the antenna on which this was measured, the type of Constant Tone
  *        Extension, the value of connEventCounter, and the IQ samples of the
  *        Constant Tone Extension of the received packet are reported in the
  *        corresponding parameters. For any given sample, either both or neither
  *        of i_sample[i] and q_sample[i] shall equal 0x80. The slot_durations
  *        parameter specifies the sampling rate used by the Controller. The
  *        packet_status parameter indicates whether the received packet had a
  *        valid CRC and, if not, whether the Controller has determined the
  *        position and size of the Constant Tone Extension using the Length and
  *        CTETime fields. Note: A Controller is not required to generate this
  *        event for packets that have a bad CRC. This event is also used by the
  *        Controller to report that it has insufficient resources to report IQ
  *        samples for all received Constant Tone Extensions and has failed to
  *        sample at least once. In this case packet_status shall be set to 0xFF
  *        and sample_count to 0x00. The Constant Tone Extension format is
  *        defined in [Vol 6] Part B, Section 2.1.5.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param rx_phy
  *        Values:
  *        - 0x01: The receiver PHY for the connection is LE 1M
  *        - 0x02: The receiver PHY for the connection is LE 2M
  * @param data_channel_index
  *        Values:
  *        - 0x00 ... 0x24: The index of the data channel on which the Data Physical Channel PDU was received.
  * @param rssi RSSI of the packet. Units: 0.1 dBm.
  *        Values:
  *        - -1270 ... 200
  * @param rssi_antenna_id ID of the antenna on which the RSSI is measured
  * @param cte_type
  *        Values:
  *        - 0x00: AoA Constant Tone Extension
  *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
  * @param slot_durations Sampling rate used by the Controller.
  *        Values:
  *        - 0x01: CTE_SLOT_1us
  *        - 0x02: CTE_SLOT_2us
  * @param packet_status
  *        Values:
  *        - 0x00: CRC was correct
  *        - 0x01: CRC was incorrect and the Length and CTETime fields of the packet were used
  *                to determine sampling points
  *        - 0x02: CRC was incorrect but the Controller has determined the position and length
  *                of the Constant Tone Extension in some other way
  *        - 0xFF: Insufficient resources to sample (channel_index, cte_type, and slot_durations invalid).
  * @param connection_event_counter The value of connEventCounter (see [Vol 6]
  *        Part B, Section 4.5.1) for the reported PDU
  * @param sample_count Total number of sample pairs.
  *        Values:
  *        - 0x00
  *        - 0x09 ... 0x52
  * @param Samples See @ref samples_t
  * @retval None
  */
void hci_le_connection_iq_report_event(uint16_t connection_handle,
                                       uint8_t rx_phy,
                                       uint8_t data_channel_index,
                                       int16_t rssi,
                                       uint8_t rssi_antenna_id,
                                       uint8_t cte_type,
                                       uint8_t slot_durations,
                                       uint8_t packet_status,
                                       uint16_t connection_event_counter,
                                       uint8_t sample_count,
                                       samples_t Samples[]);
/**
  * @brief This event is used by the Controller to report an issue following a
  *        request to a peer device to reply with a packet containing an
  *        LL_CTE_RSP PDU and a Constant Tone Extension. It shall be generated if
  *        the packet containing the LL_CTE_RSP PDU sent in response did not
  *        contain a Constant Tone Extension or if the peer rejected the request.
  *        It shall not be generated if the packet containing the LL_CTE_RSP PDU
  *        had a CRC error or if the procedure response timeout timer (see [Vol
  *        6] Part B, Section 5.2) expired.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */
void hci_le_cte_request_failed_event(uint8_t status,
                                     uint16_t connection_handle);
/**
  * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
  *        by the Controller to report that it has received periodic advertising
  *        synchronization information from the device referred to by the
  *        connection_handle parameter and either successfully synchronized to
  *        the periodic advertising train or timed out while attempting to
  *        synchronize. The status will be zero if it successfully synchronized
  *        and non-zero otherwise. The service_data value is provided by the Host
  *        of the device sending the information. The sync_handle identifies the
  *        periodic advertising in subsequent commands and events and shall be
  *        assigned by the Controller. The remaining parameters provide
  *        information about the periodic advertising (see Section 7.7.65.14). If
  *        status is non-zero, all parameter values are valid except sync_handle,
  *        which the Host shall ignore. Note: If the Controller is already
  *        synchronized to the periodic advertising train described in the
  *        received information, no event will be generated.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data A value provided by the peer device
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param advertising_sid
  *        Values:
  *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
  * @param advertiser_address_type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
  *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertiser_phy
  *        Values:
  *        - 0x01: Advertiser PHY is LE 1M
  *        - 0x02: Advertiser PHY is LE 2M
  *        - 0x03: Advertiser PHY is LE Coded
  * @param periodic_advertising_interval Periodic advertising interval. Time = N
  *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Periodic advertising interval
  * @param advertiser_clock_accuracy Advertiser Clock Accuracy
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 60 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
