zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_events.h
  */
void hci_le_periodic_advertising_sync_transfer_received_event(uint8_t status,
                                                              uint16_t connection_handle,
                                                              uint16_t service_data,
                                                              uint16_t sync_handle,
                                                              uint8_t advertising_sid,
                                                              uint8_t advertiser_address_type,
                                                              uint8_t advertising_address[6],
                                                              uint8_t advertiser_phy,
                                                              uint16_t periodic_advertising_interval,
                                                              uint8_t advertiser_clock_accuracy);
/**
  * @brief Report a path loss threshold crossing on the ACL connection identified
  *        by the connection_handle parameter.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param current_path_loss Current path loss (always zero or positive). Units:
  *        dB.
  *        Values:
  *        - 0 ... 254
  *        - 255: NA
  * @param zone_entered The zone_entered parameter indicates which zone was
  *        entered.
  *        Values:
  *        - 0x00: LOW_ZONE
  *        - 0x01: MIDDLE_ZONE
  *        - 0x02: HIGH_ZONE
  * @retval None
  */
void hci_le_path_loss_threshold_event(uint16_t connection_handle,
                                      uint8_t current_path_loss,
                                      uint8_t zone_entered);
/**
  * @brief Report the transmit power level on the ACL connection identified by
  *        the connection_handle parameter.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason The reason why the event was sent and the device whose transmit
  *        power level is being reported. - 0x00: Local transmit power changed -
  *        0x01: Remote transmit power changed - 0x02:
  *        HCI_LE_Read_Remote_Transmit_Power_Level command completed
  *        Values:
  *        - 0x00: LOCAL_TX_POWER_CHANGE
  *        - 0x01: REMOTE_TX_POWER_CHANGE
  *        - 0x02: READ_REMOTE_TX_POWER_COMPLETE
  * @param phy PHY associated with the connection  (not necessarily the currently
  *        used one).
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @param transmit_power_level The transmit power level for the PHY (dBm).
  *        Values:
  *        - -127 ... 20
  *        - 126: POWER_NOT_MANAGED
  *        - 127: POWER_NA
  * @param Transmit_Power_Level_Flag It indicates whether the transmit power
  *        level that is being reported has reached its minimum and/or maximum
  *        level. Transmit_Power_Level_Flag shall be ignored if the
  *        transmit_power_level parameter is set to 0x7E or 0x7F.
  *        Flags:
  *        - 0x01: MIN_TX_POWER_BIT
  *        - 0x02: MAX_TX_POWER_BIT
  * @param delta The Delta parameter is set to the change in power level for the
  *        transmitter being reported, whenever it changes its transmit power
  *        level. Delta shall be ignored if the transmit_power_level parameter is
  *        set to 0x7E.
  *        Values:
  *        - 0 ... 126
  *        - 127: NA
  * @retval None
  */
void hci_le_transmit_power_reporting_event(uint8_t status,
                                           uint16_t connection_handle,
                                           uint8_t reason,
                                           uint8_t phy,
                                           int8_t transmit_power_level,
                                           uint8_t Transmit_Power_Level_Flag,
                                           int8_t delta);
/**
  * @}
  */
/**
  *@defgroup ACI_GAP_events ACI GAP events
  *@brief ACI GAP events layer.
  *@{
  */
/* ACI GAP events */
/**
  * @brief This event is generated by the controller when the limited
  *        discoverable mode ends due to timeout. The timeout is 180 seconds.
  * @retval None
  */
void aci_gap_limited_discoverable_event(void);
/**
  * @brief This event is generated when the pairing process has completed
  *        successfully or a pairing procedure timeout has occurred or the
  *        pairing has failed. This is to notify the application that we have
  *        paired with a remote device so that it can take further actions or to
  *        notify that a timeout has occurred so that the upper layer can decide
  *        to disconnect the link.
  * @param connection_handle Connection handle on which the pairing procedure
  *        completed
  * @param status Pairing status. If 0x02, see reason code.
  *        Values:
  *        - 0x00: Success
  *        - 0x01: Timeout
  *        - 0x02: Pairing Failed
  *        - 0x03: Encryption failed, LTK missing on local device
  *        - 0x04: Encryption failed, LTK missing on peer device
  *        - 0x05: Encryption not supported by remote device
  * @param reason Pairing reason error code
  *        Values:
  *        - 0x00
  *        - 0x01: PASSKEY_ENTRY_FAILED
  *        - 0x02: OOB_NOT_AVAILABLE
  *        - 0x03: AUTH_REQ_CANNOT_BE_MET
  *        - 0x04: CONFIRM_VALUE_FAILED
  *        - 0x05: PAIRING_NOT_SUPPORTED
  *        - 0x06: INSUFF_ENCRYPTION_KEY_SIZE
  *        - 0x07: CMD_NOT_SUPPORTED
  *        - 0x08: UNSPECIFIED_REASON
  *        - 0x09: VERY_EARLY_NEXT_ATTEMPT
  *        - 0x0A: SM_INVALID_PARAMS
  *        - 0x0B: SMP_SC_DHKEY_CHECK_FAILED
  *        - 0x0C: SMP_SC_NUMCOMPARISON_FAILED
  * @retval None
  */
void aci_gap_pairing_complete_event(uint16_t connection_handle,
                                    uint8_t status,
                                    uint8_t reason);
/**
  * @brief This event is generated by the Security manager to the application
  *        when a passkey is required for pairing. When this event is received,
  *        the application has to respond with the @ref aci_gap_pass_key_resp
  *        command.
  * @param connection_handle Connection handle for which the passkey has been
  *        requested.
  * @retval None
  */
void aci_gap_pass_key_req_event(uint16_t connection_handle);
/**
  * @brief This event is generated by the Security manager to the application when the application has
  * set that authorization is required for reading/writing of attributes. This event will be
  * generated as soon as the pairing is complete. When this event is received,
  * @ref aci_gap_authorization_resp command should be used to respond by the application.
  * @param connection_handle Connection handle for which authorization has been requested.
  * @retval None
  */
void aci_gap_authorization_req_event(uint16_t connection_handle);
/**
  * @brief This event is generated when the slave security request is
  *        successfully sent to the master.
  * @retval None
  */
void aci_gap_slave_security_initiated_event(void);
/**
  * @brief This event is generated on the slave when a
  *        ACI_GAP_SLAVE_SECURITY_REQUEST is called to reestablish the bond with
  *        a master but the master has lost the bond. When this event is
  *        received, the upper layer has to issue the ACI_GAP_ALLOW_REBOND
  *        command in order to allow the slave to continue the pairing process
  *        with the master. On the master this event is raised when
  *        ACI_GAP_SEND_PAIRING_REQUEST is called to reestablish a bond with a
  *        slave but the slave has lost the bond. In order to create a new bond
  *        the master has to launch ACI_GAP_SEND_PAIRING_REQUEST with
  *        force_rebond set to 1.
  * @retval None
  */
void aci_gap_bond_lost_event(void);
/**
  * @brief This event is sent by the GAP to the upper layers when a procedure
  *        previously started has been terminated by the upper layer or has
  *        completed for any other reason
  * @param procedure_code Code identifying the procedure.
  *        Values:
  *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
  *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
  *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x05: GAP_OBSERVATION_PROC
  *        - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x07: GAP_NAME_DISCOVERY_PROC
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section.
  * @param data_length Length of Data in octets
  * @param data Procedure Specific Data: - For Name Discovery Procedure: the name
  *        of the peer device if the procedure completed successfully.
  * @retval None
  */
void aci_gap_proc_complete_event(uint8_t procedure_code,
                                 uint8_t status,
                                 uint8_t data_length,
                                 uint8_t data[]);
/**
  * @brief This event is sent only by a privacy enabled Peripheral. The event is
  *        sent to the upper layers when the peripheral is unsuccessful in
  *        resolving the resolvable address of the peer device after connecting
  *        to it.
  * @param connection_handle Connection handle for which the private address
  *        could not be resolved with any of the stored IRK's.
  * @retval None
  */
void aci_gap_addr_not_resolved_event(uint16_t connection_handle);
/**
  * @brief This event is sent only during SC v.4.2 Pairing, when Numeric
  *        Comparison Association model is selected, in order to show the Numeric
  *        Value generated, and to ask for Confirmation to the User. When this
  *        event is received, the application has to respond with the  @ref
  *        aci_gap_numeric_comparison_value_confirm_yesno command
  * @param connection_handle Connection handle related to the underlying Pairing
  * @param numeric_value
  * @retval None
  */
void aci_gap_numeric_comparison_value_event(uint16_t connection_handle,
                                            uint32_t numeric_value);
/**
  * @brief This event is sent only during SC v.4.2 Pairing, when Keypress
  *        Notifications are supported, in order to show the input type signalled
  *        by the peer device, having Keyboard only I/O capabilities. When this
  *        event is received, no action is required to the User.
  * @param connection_handle Connection handle related to the underlying Pairing
  * @param notification_type Type of Keypress input notified/signaled by peer
  *        device
  *        Values:
  *        - 0x00: PASSKEY_ENTRY_STARTED
  *        - 0x01: PASSKEY_DIGIT_ENTERED
  *        - 0x02: PASSKEY_DIGIT_ERASED
  *        - 0x03: PASSKEY_CLEARED
  *        - 0x04: PASSKEY_ENTRY_COMPLETED
  * @retval None
  */
void aci_gap_keypress_notification_event(uint16_t connection_handle,
                                         uint8_t notification_type);

/**
  * @brief This event is generated to the application by the GATT server when a client modifies any
  *        attribute on the server, as consequence of one of the following GATT procedures:
  *        - write without response
  *        - signed write without response
  *        - write characteristic value
  *        - write long characteristic value
  *        - reliable write.
  * @param connection_handle The connection handle which modified the attribute.
  * @param attr_handle Handle of the attribute that was modified.
  * @param offset SoC mode: the offset is never used and it is always 0. Network coprocessor mode:
  *               - Bits 0-14: offset of the reported value inside the attribute.
  *               - Bit 15: if the entire value of the attribute does not fit inside a single
  *                         ACI_GATT_ATTRIBUTE_MODIFIED_EVENT event, this bit is set to 1 to notify that
  *                         other ACI_GATT_ATTRIBUTE_MODIFIED_EVENT events will follow to report the remaining value.
  * @param attr_data_length Length of attr_data in octets
  * @param attr_data The modified value
  * @retval None
  */
void aci_gatt_attribute_modified_event(uint16_t connection_handle,
                                       uint16_t attr_handle,
                                       uint16_t offset,
                                       uint16_t attr_data_length,
                                       uint8_t attr_data[]);

/**
  * @brief This event is generated when a GATT client procedure completes either with error or
successfully.
  * @param connection_handle Connection handle related to the response
  * @param error_code Indicates whether the procedure completed with an error or was successful
  * Values:
  - 0x00: Success
  - 0x01: Unknown HCI Command
  - 0x02: Unknown Connection Identifier
  - 0x03: Hardware Failure
  - 0x04: Page Timeout
  - 0x05: Authentication Failure
  - 0x06: PIN or Key Missing
  - 0x07: Memory Capacity Exceeded
  - 0x08: Connection Timeout
  - 0x09: Connection Limit Exceeded
  - 0x0A: Synchronous Connection Limit to a Device Exceeded
  - 0x0B: ACL Connection Already Exists
  - 0x0C: Command Disallowed
  - 0x0D: Connection Rejected Due To Limited Resources
  - 0x0E: Connection Rejected Due To Security Reasons
  - 0x0F: Connection Rejected due to Unacceptable BD_ADDR
  - 0x10: Connection Accept Timeout Exceeded
  - 0x11: Unsupported Feature Or Parameter Value
  - 0x12: Invalid HCI Command Parameters
  - 0x13: Remote User Terminated Connection
  - 0x14: Remote Device Terminated Connection due to Low Resources
  - 0x15: Remote Device Terminated Connection due to Power Off
  - 0x16: Connection Terminated By Local Host
  - 0x17: Repeated Attempts
  - 0x18: Pairing Not Allowed
  - 0x19: Unknown LMP PDU
  - 0x1A: Unsupported Remote Feature / Unsupported LMP Feature
  - 0x1B: SCO Offset Rejected
  - 0x1C: SCO Interval Rejected
  - 0x1D: SCO Air Mode Rejected
  - 0x1E: Invalid LMP Parameters
  - 0x1F: Unspecified Error
  - 0x20: Unsupported LMP Parameter Value
  - 0x21: Role Change Not Allowed
  - 0x22: LMP Response Timeout / LL Response Timeout
  - 0x23: LMP Error Transaction Collision
  - 0x24: LMP PDU Not Allowed
  - 0x25: Encryption Mode Not Acceptable
  - 0x26: Link Key cannot be Changed
  - 0x27: Requested QoS Not Supported
  - 0x28: Instant Passed
  - 0x29: Pairing With Unit Key Not Supported
  - 0x2A: Different Transaction Collision
  - 0x2C: QoS Unacceptable Parameter
  - 0x2D: QoS Rejected
  - 0x2E: Channel Assessment Not Supported
  - 0x2F: Insufficient Security
  - 0x30: Parameter Out Of Mandatory Range
  - 0x32: Role Switch Pending
  - 0x34: Reserved Slot Violation
  - 0x35: Role Switch Failed
  - 0x36: Extended Inquiry Response Too Large
  - 0x37: Secure Simple Pairing Not Supported by Host
  - 0x38: Host Busy - Pairing
  - 0x39: Connection Rejected due to No Suitable Channel Found
  - 0x3A: Controller Busy
  - 0x3B: Unacceptable Connection Interval
  - 0x3C: Directed Advertising Timeout
  - 0x3D: Connection Terminated Due to MIC Failure
  - 0x3E: Connection Failed to be Established
  - 0x3F: MAC of the 802.11 AMP
  - 0x41: Failed
  - 0x42: Invalid parameters
  - 0x43: Busy
  - 0x44: Invalid length
  - 0x45: Pending
  - 0x46: Not allowed
  - 0x47: GATT error
  - 0x48: Address not resolved
  - 0x50: Invalid CID
  - 0x5A: CSRK not found
  - 0x5B: IRK not found
  - 0x5C: Device not found in DB
  - 0x5D: Security DB full
  - 0x5E: Device not bonded
  - 0x5F: Device in blacklist
  - 0x60: Invalid handle
  - 0x61: Invalid parameter
  - 0x62: Out of handles
  - 0x63: Invalid operation
  - 0x64: Insufficient resources
  - 0x65: Insufficient encryption key size
  - 0x66: Characteristic already exist
  - 0x82: No valid slot
  - 0x83: Short window
  - 0x84: New interval failed
  - 0x85: Too large interval
  - 0x86: Slot length failed
  - 0xFA: Flash read failed
  - 0xFB: Flash write failed
  - 0xFC: Flash erase failed
  * @retval None
  */
void aci_gatt_proc_complete_event(uint16_t connection_handle, uint8_t error_code);
/**
  * @brief This event is generated when an Error Response is received from the server. The error
response can be given by the server at the end of one of the GATT discovery procedures.
This does not mean that the procedure ended with an error, but this error event is part of the
procedure itself.
  * @param connection_handle Connection handle related to the response
  * @param req_op_code The request that generated this error response
  * @param attribute_handle The attribute handle that generated this error response
  * @param error_code The reason why the request has generated an error response (ATT error codes)
  * Values:
  - 0x01: Invalid handle
  - 0x02: Read not permitted
  - 0x03: Write not permitted
  - 0x04: Invalid PDU
  - 0x05: Insufficient authentication
  - 0x06: Request not supported
  - 0x07: Invalid offset
  - 0x08: Insufficient authorization
  - 0x09: Prepare queue full
  - 0x0A: Attribute not found
  - 0x0B: Attribute not long
  - 0x0C: Insufficient encryption key size
  - 0x0D: Invalid attribute value length
  - 0x0E: Unlikely error
  - 0x0F: Insufficient encryption
  - 0x10: Unsupported group type
  - 0x11: Insufficient resources
  * @retval None
  */
void aci_gatt_error_resp_event(uint16_t connection_handle,
                               uint8_t req_op_code,
                               uint16_t attribute_handle,
                               uint8_t error_code);
/**
  * @brief This event can be generated during a "Discover Characteristics By UUID" procedure or a
  *        "Read using Characteristic UUID" procedure.
  *        The attribute value will be a service declaration as defined in Bluetooth Core v4.1spec
  *        (vol.3, Part G, ch. 3.3.1), when a "Discover Characteristics By UUID" has been started. It will
  *        be the value of the Characteristic if a* "Read using Characteristic UUID" has been
  *        performed.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The attribute value will be a service declaration as defined in Bluetooth Core v4.0 spec
  *        (vol.3, Part G, ch. 3.3.1), when a "Discover Characteristics By UUID" has been started.
  *        It will be the value of the Characteristic if a "Read using Characteristic UUID" has been performed.
  * @retval None
  */
void aci_gatt_disc_read_char_by_uuid_resp_event(uint16_t connection_handle,
                                                uint16_t attribute_handle,
                                                uint8_t attribute_value_length,
                                                uint8_t attribute_value[]);
/**
  * @brief This event is given to the application when a write request, write command or signed write
  *        command is received by the server from the client. This event will be given to the application
  *        only if the event bit for this event generation is set when the characteristic was added.
  *        When this event is received, the application has to check whether the value being requested
  *        for write can be allowed to be written and respond with the command @ref aci_gatt_write_resp.
  *        The details of the parameters of the command can be found. Based on the response from
  *        the application, the attribute value will be modified by the stack. If the write is rejected by the
  *        application, then the value of the attribute will not be modified. In case of a write REQ, an
  *        error response will be sent to the client, with the error code as specified by the application.
  *        In case of write/signed write commands, no response is sent to the client but the attribute is
  *        not modified.
  * @param connection_handle Handle of the connection on which there was the request to write the attribute
  * @param attribute_handle The handle of the attribute
  * @param data_length Length of Data field
  * @param data The data that the client has requested to write
  * @retval None
  */
void aci_gatt_write_permit_req_event(uint16_t connection_handle,
                                     uint16_t attribute_handle,
                                     uint8_t data_length,
                                     uint8_t data[]);
/**
  * @brief This event is given to the application when a read request or read blob request is received
  *        by the server from the client. This event will be given to the application only if the event bit
  *        for this event generation is set when the characteristic was added.
  *        On receiving this event, the application can update the value of the handle if it desires and
  *        when done, it has to send the @ref aci_gatt_allow_read command to indicate to the stack that it
  *        can send the response to the client.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param offset Contains the offset from which the read has been requested
  * @retval None
  */
void aci_gatt_read_permit_req_event(uint16_t connection_handle,
                                    uint16_t attribute_handle,
                                    uint16_t offset);

/**
  * @}
  */
/**
  *@defgroup ACI_GATT_ATT_events ACI GATT/ATT events
  *@brief ACI GATT/ATT events layer.
  *@{
  */
/* ACI GATT/ATT events */
/** Documentation for C struct attribute_group_handle_pair_t */
typedef struct attribute_group_handle_pair_t_s
{
  /** Found Attribute handle
   */
  uint16_t found_attribute_handle;
  /** Group End handle
   */
  uint16_t group_end_handle;
} attribute_group_handle_pair_t;
