zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_events.h
/**
  * @brief This event is generated to the application by the GATT server when a
  *        client modifies any attribute on the server, as consequence of one of
  *        the following GATT procedures: - write without response - signed write
  *        without response - write characteristic value - write long
  *        characteristic value - reliable write.
  * @param connection_handle The connection handle which modified the attribute.
  * @param attr_handle Handle of the attribute that was modified.
  * @param attr_data_length Length of attr_data in octets
  * @param attr_data The modified value
  * @retval None
  */
void aci_gatt_srv_attribute_modified_event(uint16_t connection_handle,
                                           uint16_t attr_handle,
                                           uint16_t attr_data_length,
                                           uint8_t attr_data[]);
/**
  * @brief This event is generated by the client/server to the application on a
  *        GATT timeout (30 seconds). This is a critical event that should not
  *        happen during normal operating conditions. It is an indication of
  *        either a major disruption in the communication link or a mistake in
  *        the application which does not provide a reply to GATT procedures.
  *        After this event, the GATT channel is closed and no more GATT
  *        communication can be performed. The applications is expected to issue
  *        an @ref aci_gap_terminate to disconnect from the peer device. It is
  *        important to leave an 100 ms blank window before sending the @ref
  *        aci_gap_terminate, since immediately after this event, system could
  *        save important information in non volatile memory.
  * @param connection_handle Connection handle on which the GATT procedure has
  *        timed out
  * @retval None
  */
void aci_gatt_proc_timeout_event(uint16_t connection_handle);
/**
  * @brief This event is generated in response to an Exchange MTU request (local
  *        or from the peer). See aci_gatt_clt_exchange_config().
  * @param connection_handle Connection handle related to the response
  * @param server_rx_mtu ATT_MTU value agreed between server and client
  * @retval None
  */
void aci_att_exchange_mtu_resp_event(uint16_t connection_handle,
                                     uint16_t server_rx_mtu);
/**
  * @brief This event is generated in response to a Find Information Request. See
  *        @ref aci_att_find_info_req and Find Information Response in Bluetooth Core v4.1 spec.
  * @param connection_handle Connection handle related to the response
  * @param format Format of the hanndle-uuid pairs
  * @param event_data_length Length of handle_uuid_pair in octets
  * @param handle_uuid_pair A sequence of handle-uuid pairs. if format=1, each pair is:[2 octets for handle,
  *                         2 octets for UUIDs], if format=2, each pair is:[2 octets for handle, 16 octets for UUIDs]
  * @retval None
  */
void aci_att_find_info_resp_event(uint16_t connection_handle,
                                  uint8_t format,
                                  uint8_t event_data_length,
                                  uint8_t handle_uuid_pair[]);
/**
  * @brief This event is generated in response to a @ref aci_att_find_by_type_value_req
  * @param connection_handle Connection handle related to the response
  * @param num_of_handle_pair Number of attribute, group handle pairs
  * @param attr_group_handle_pair See @ref attribute_group_handle_pair_t
  * @retval None
  */
void aci_att_find_by_type_value_resp_event(uint16_t connection_handle,
                                           uint8_t num_of_handle_pair,
                                           attribute_group_handle_pair_t attr_group_handle_pair[]);
/**
  * @brief This event is generated in response to a @ref aci_att_read_by_type_req. See
  *        @ref aci_gatt_find_included_services and @ref aci_gatt_disc_all_char_desc.
  * @param connection_handle Connection handle related to the response
  * @param handle_value_pair_length The size of each attribute handle-value pair
  * @param data_length Length of handle_value_pair_data in octets
  * @param handle_value_pair_data Attribute Data List as defined in Bluetooth Core v4.1 spec.
  *                               A sequence of handle-value pairs: [2 octets for Attribute Handle,
  *                               (handle_value_pair_length - 2 octets) for Attribute Value]
  * @retval None
  */
void aci_att_read_by_type_resp_event(uint16_t connection_handle,
                                     uint8_t handle_value_pair_length,
                                     uint8_t data_length,
                                     uint8_t handle_value_pair_data[]);
/**
  * @brief This event is generated in response to a Read Request. See @ref aci_gatt_read_char_value.
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value The value of the attribute.
  * @retval None
  */
void aci_att_read_resp_event(uint16_t connection_handle,
                             uint8_t event_data_length,
                             uint8_t attribute_value[]);
/**
  * @brief This event can be generated during a read long characteristic value procedure.
  *        See @ref aci_gatt_read_long_char_value.
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value Part of the attribute value.
  * @retval None
  */
void aci_att_read_blob_resp_event(uint16_t connection_handle,
                                  uint8_t event_data_length,
                                  uint8_t attribute_value[]);
/**
  * @brief This event is generated in response to a Read Multiple Request.
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param set_of_values A set of two or more values.
  *                      A concatenation of attribute values for each of the attribute handles
  *                      in the request in the order that they were requested.
  * @retval None
  */
void aci_att_read_multiple_resp_event(uint16_t connection_handle,
                                      uint8_t event_data_length,
                                      uint8_t set_of_values[]);
/**
  * @brief This event is generated in response to a Read By Group Type Request. See
  *        @ref aci_gatt_disc_all_primary_services.
  * @param connection_handle Connection handle related to the response
  * @param Attribute_Data_Length The size of each attribute data
  * @param data_length Length of attribute_data_list in octets
  * @param attribute_data_list Attribute Data List as defined in Bluetooth Core v4.1 spec.
  *                            A sequence of attribute handle, end group handle, attribute value tuples:
  *                            [2 octets for Attribute Handle, 2 octets End Group Handle,
  *                             (Attribute_Data_Length - 4 octets) for Attribute Value]
  * @retval None
  */
void aci_att_read_by_group_type_resp_event(uint16_t connection_handle,
                                           uint8_t Attribute_Data_Length,
                                           uint8_t data_length,
                                           uint8_t attribute_data_list[]);
/**
  * @brief This event is generated in response to a @ref aci_att_prepare_write_req.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute to be written
  * @param offset The offset of the first octet to be written.
  * @param part_attribute_value_length Length of part_attribute_value in octets
  * @param part_attribute_value The value of the attribute to be written
  * @retval None
  */
void aci_att_prepare_write_resp_event(uint16_t connection_handle,
                                      uint16_t attribute_handle,
                                      uint16_t offset,
                                      uint8_t part_attribute_value_length,
                                      uint8_t part_attribute_value[]);
/**
  * @brief This event is generated in response to an Execute Write Request.
  * @param connection_handle Connection handle related to the response
  * @retval None
  */
void aci_att_exec_write_resp_event(uint16_t connection_handle);
/**
  * @brief This event is generated in response to a Find Information Request
  *        during a discovery procedure for all the characteristic descriptors.
  *        See aci_gatt_clt_disc_all_char_desc() and Find Information Response in
  *        Bluetooth Core spec.
  * @param connection_handle Connection handle related to the response
  * @param format Format of the hanndle-uuid pairs
  * @param event_data_length Length of handle_uuid_pair in octets
  * @param handle_uuid_pair A sequence of handle-uuid pairs. if format=1, each
  *        pair is:[2 octets for handle, 2 octets for UUIDs], if format=2, each
  *        pair is:[2 octets for handle, 16 octets for UUIDs]
  * @retval None
  */
void aci_att_clt_find_info_resp_event(uint16_t connection_handle,
                                      uint8_t format,
                                      uint16_t event_data_length,
                                      uint8_t handle_uuid_pair[]);
/**
  * @brief This event is generated during a "discover service by UUID" procedure.
  *        See aci_gatt_clt_disc_primary_service_by_uuid().
  * @param connection_handle Connection handle related to the response
  * @param num_of_handle_pair Number of attribute, group handle pairs
  * @param attr_group_handle_pair See @ref attribute_group_handle_pair_t
  * @retval None
  */
void aci_att_clt_find_by_type_value_resp_event(uint16_t connection_handle,
                                               uint8_t num_of_handle_pair,
                                               attribute_group_handle_pair_t attr_group_handle_pair[]);
/**
  * @brief This event is generated in response to a ATT_READ_BY_TYPE_REQ, during
  *        a "find included service" procedure or a "discover all
  *        characteristics" procedure. See aci_gatt_clt_find_included_services()
  *        and aci_gatt_clt_disc_all_char_of_service().
  * @param connection_handle Connection handle related to the response
  * @param handle_value_pair_length The size of each attribute handle-value pair
  * @param data_length Length of handle_value_pair_data in octets
  * @param handle_value_pair_data Attribute Data List as defined in Bluetooth
  *        Core v4.1 spec. A sequence of handle-value pairs: [2 octets for
  *        Attribute Handle, (handle_value_pair_length - 2 octets) for Attribute
  *        Value]
  * @retval None
  */
void aci_att_clt_read_by_type_resp_event(uint16_t connection_handle,
                                         uint8_t handle_value_pair_length,
                                         uint16_t data_length,
                                         uint8_t handle_value_pair_data[]);
/**
  * @brief This event is generated in response to a Read Request. See
  *        aci_gatt_clt_read().
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value The value of the attribute.
  * @retval None
  */
void aci_att_clt_read_resp_event(uint16_t connection_handle,
                                 uint16_t event_data_length,
                                 uint8_t attribute_value[]);
/**
  * @brief This event can be generated during a read long characteristic value
  *        procedure. See aci_gatt_clt_read_long().
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value Part of the attribute value.
  * @retval None
  */
void aci_att_clt_read_blob_resp_event(uint16_t connection_handle,
                                      uint16_t event_data_length,
                                      uint8_t attribute_value[]);
/**
  * @brief This event is generated in response to a Read Multiple Request. See
  *        aci_gatt_clt_read_multiple_char_value().
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param set_of_values A set of two or more values. A concatenation of
  *        attribute values for each of the attribute handles in the request in
  *        the order that they were requested.
  * @retval None
  */
void aci_att_clt_read_multiple_resp_event(uint16_t connection_handle,
                                          uint16_t event_data_length,
                                          uint8_t set_of_values[]);
/**
  * @brief This event is generated in response to a Read By Group Type Request,
  *        during a "discover all primary services" procedure. See
  *        aci_gatt_clt_disc_all_primary_services().
  * @param connection_handle Connection handle related to the response
  * @param Attribute_Data_Length The size of each attribute data
  * @param data_length Length of attribute_data_list in octets
  * @param attribute_data_list Attribute Data List as defined in Bluetooth Core
  *        v4.1 spec. A sequence of attribute handle, end group handle, attribute
  *        value tuples: [2 octets for Attribute Handle, 2 octets End Group
  *        Handle, (Attribute_Data_Length - 4 octets) for Attribute Value]
  * @retval None
  */
void aci_att_clt_read_by_group_type_resp_event(uint16_t connection_handle,
                                               uint8_t Attribute_Data_Length,
                                               uint16_t data_length,
                                               uint8_t attribute_data_list[]);
/**
  * @brief This event is generated in response to an ATT_PREPARE_WRITE_REQ during
  *        a write long characteristic value procedure. See
  *        aci_gatt_clt_write_long().
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute to be written
  * @param offset The offset of the first octet to be written.
  * @param part_attribute_value_length Length of part_attribute_value in octets
  * @param part_attribute_value The value of the attribute to be written
  * @retval None
  */
void aci_att_clt_prepare_write_resp_event(uint16_t connection_handle,
                                          uint16_t attribute_handle,
                                          uint16_t offset,
                                          uint16_t part_attribute_value_length,
                                          uint8_t part_attribute_value[]);
/**
  * @brief This event is generated in response to an ATT Execute Write Request,
  *        during a write long characteristic value procedure. See
  *        aci_gatt_clt_write_long().
  * @param connection_handle Connection handle related to the response
  * @retval None
  */
void aci_att_clt_exec_write_resp_event(uint16_t connection_handle);
/**
  * @brief This event is generated when an indication is received from the
  *        server.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The current value of the attribute
  * @retval None
  */
void aci_gatt_clt_indication_event(uint16_t connection_handle,
                                   uint16_t attribute_handle,
                                   uint16_t attribute_value_length,
                                   uint8_t attribute_value[]);
/**
  * @brief This event is generated when a notification is received from the
  *        server.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The current value of the attribute
  * @retval None
  */
void aci_gatt_clt_notification_event(uint16_t connection_handle,
                                     uint16_t attribute_handle,
                                     uint16_t attribute_value_length,
                                     uint8_t attribute_value[]);
/**
  * @brief This event is generated when a GATT client procedure completes either
  *        with error or successfully.
  * @param connection_handle Connection handle related to the response
  * @param error_code For standard error codes see Bluetooth specification, Vol.
  *        2, part D. For proprietary error code refer to Error codes section.
  * @retval None
  */
void aci_gatt_clt_proc_complete_event(uint16_t connection_handle,
                                      uint8_t error_code);
/**
  * @brief This event is generated when an Error Response is received from the
  *        server. The error response can be given by the server at the end of
  *        one of the GATT discovery procedures. This does not mean that the
  *        procedure ended with an error, but this error event is part of the
  *        procedure itself.
  * @param connection_handle Connection handle related to the response
  * @param req_op_code The request that generated this error response
  * @param attribute_handle The attribute handle that generated this error
  *        response
  * @param error_code The reason why the request has generated an error response
  *        (ATT error codes)
  *        Values:
  *        - 0x01: Invalid handle
  *        - 0x02: Read not permitted
  *        - 0x03: Write not permitted
  *        - 0x04: Invalid PDU
  *        - 0x05: Insufficient authentication
  *        - 0x06: Request not supported
  *        - 0x07: Invalid offset
  *        - 0x08: Insufficient authorization
  *        - 0x09: Prepare queue full
  *        - 0x0A: Attribute not found
  *        - 0x0B: Attribute not long
  *        - 0x0C: Insufficient encryption key size
  *        - 0x0D: Invalid attribute value length
  *        - 0x0E: Unlikely error
  *        - 0x0F: Insufficient encryption
  *        - 0x10: Unsupported group type
  *        - 0x11: Insufficient resources
  * @retval None
  */
void aci_gatt_clt_error_resp_event(uint16_t connection_handle,
                                   uint8_t req_op_code,
                                   uint16_t attribute_handle,
                                   uint8_t error_code);
/**
  * @brief This event can be generated during a "Discover Characteristics By
  *        UUID" procedure or a "Read using Characteristic UUID" procedure.
  *        During a "Discover Characteristics By UUID" procedure, attribute_value
  *        is a characteristic declaration as defined in Bluetooth Core spec
  *        (vol.3, Part G, ch. 3.3.1), i.e. it is composed by: Characteristic
  *        Properties (1 octet), Characteristic Value Handle (2 octets) and
  *        Characteristic UUID (2 or 16 octets). During a "Read using
  *        Characteristic UUID" procedure, attribute_value is the value of the
  *        characteristic.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The attribute value will be a characteristic
  *        declaration as defined in Bluetooth Core spec (vol.3, Part G, ch.
  *        3.3.1), when a "Discover Characteristics By UUID" has been started. It
  *        will be the value of the Characteristic if a "Read using
  *        Characteristic UUID" has been performed.
  * @retval None
  */
void aci_gatt_clt_disc_read_char_by_uuid_resp_event(uint16_t connection_handle,
                                                    uint16_t attribute_handle,
                                                    uint8_t attribute_value_length,
                                                    uint8_t attribute_value[]);
/**
  * @brief Each time BLE FW stack raises the error code @ref
  *        ble_status_insufficient_resources, aci_gatt_tx_pool_available_event()
  *        is generated as soon as the available buffer size  is greater than
  *        maximum ATT MTU.
  * @param connection_handle Connection handle related to the request
  * @param available_buffers Not used.
  * @retval None
  */
void aci_gatt_tx_pool_available_event(uint16_t connection_handle,
                                      uint16_t available_buffers);
/**
  * @brief This event is generated when the client has sent the confirmation to a previously sent indication
  * @param connection_handle Connection handle related to the event
  * @retval None
  */
void aci_gatt_server_confirmation_event(uint16_t connection_handle);
/**
  * @brief This event is given to the application when a prepare write request
  *        is received by the server from the client. This event will be given to the application
  *        only if the event bit for this event generation is set when the characteristic was added.
  *        When this event is received, the application has to check whether the value being requested
  *        for write can be allowed to be written and respond with the command @ref aci_gatt_write_resp.
  *        Based on the response from the application, the attribute value will be modified by the stack.
  *        If the write is rejected by the application, then the value of the attribute will not be modified
  *        and an error response will be sent to the client, with the error code as specified by the application.
  * @param connection_handle Handle of the connection on which there was the request to write the attribute
  * @param attribute_handle The handle of the attribute
  * @param offset The offset from which the prepare write has been requested
  * @param data_length Length of Data field
  * @param data The data that the client has requested to write
  * @retval None
  */
void aci_gatt_prepare_write_permit_req_event(uint16_t connection_handle,
                                             uint16_t attribute_handle,
                                             uint16_t offset,
                                             uint8_t data_length,
                                             uint8_t data[]);
/**
  * @brief This event is generated when the client has sent the confirmation to a
  *        previously sent indication.
  * @param connection_handle Connection handle related to the event.
  * @retval None
  */
void aci_gatt_srv_confirmation_event(uint16_t connection_handle);
/**
  * @brief This event is generated when an execute write request is received from
  *        the peer. This happens when the client wants to write a long attribute
  *        (i.e. an attribute with a size greater than ATT_MTU -3) or more than
  *        one attribute in a single operation. The aci_gatt_srv_exec_write_resp
  *        command must be sent to give a response to the peer.
  * @param connection_handle Handle identifying the connection where the execute
  *        write operation has been received.
  * @param flags If 1, peer wants to execute all the queued writes. If 0, all
  *        queued writes must be discarded.
  *        Values:
  *        - 0x00: FLUSH
  *        - 0x01: EXECUTE
  * @retval None
  */
void aci_att_srv_exec_write_req_event(uint16_t connection_handle,
                                      uint8_t flags);
/**
  * @brief This event is generated if authorization is needed to access the
  *        attribute value. aci_gatt_srv_authorize_resp_nwk command must be sent
  *        in response to this event.
  * @param conn_handle Connection handle to be used to identify the connection
  *        with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle
